## KPMG Virtual Internship (Module 1 Task - CustomerDemographic)

### Author: Ashley Ooi

In [1]:
# Importing the necessary libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
# Importing the xlsx file provided 
# pandas is used to read the file 'CustomerDemographic.xlsx'
df = pd.read_excel('CustomerDemographic.xlsx')
df.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

In [3]:
# Understanding the data
# Checking the number of rows and columns
df.shape

(4000, 13)

In [4]:
# checking the data types
df.dtypes

customer_id                                     int64
first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
default                                        object
owns_car                                       object
tenure                                        float64
dtype: object

In [5]:
# checking the unique values for the column 'gender'
df['gender'].unique()

array(['F', 'Male', 'Female', 'U', 'Femal', 'M'], dtype=object)

In [6]:
# replacing values to achieve consistency of data 
df['gender'].replace({"F": "Female", "Femal": "Female", "M": "Male"}, inplace=True)

In [7]:
# delete the column 'default' as it has no meaning to the dataset
del df['default']

In [8]:
# displaying to first 5 rows of the dataset to make sure changes are made
df.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0

In [9]:
# checking the total number of NA for each of the columns
df.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
dtype: int64

In [10]:
# Counts the unique values for column 'last_name'
df['last_name'].value_counts()

Pristnor       3
Ramsdell       3
Bushell        2
Cotillard      2
Strutz         2
              ..
Monkhouse      1
Scarasbrick    1
Cristofolo     1
McChesney      1
Tremlett       1
Name: last_name, Length: 3725, dtype: int64

In [11]:
# Replace all NaN elements with the last observed non-null value forward until another 
# non-null value is encountered
df['last_name']=df['last_name'].fillna(method='ffill')

In [12]:
# checking if all of the NaN elements is being replaced
df['last_name'].isnull().sum()

0

In [13]:
# Counts the unique values for column 'DOB'
df['DOB'].value_counts()

1978-01-30    7
1977-05-13    4
1976-07-16    4
1978-08-19    4
1976-09-25    4
             ..
1974-06-16    1
1969-11-21    1
1961-11-24    1
1995-05-03    1
1972-04-14    1
Name: DOB, Length: 3448, dtype: int64

In [14]:
# Replace all NaN elements with the last observed non-null value forward until another 
# non-null value is encountered
df['DOB']=df['DOB'].fillna(method='ffill')

In [15]:
# checking if all of the NaN elements is being replaced
df['DOB'].isnull().sum()

0

In [16]:
# Counts the unique values for column 'job_title'
df['job_title'].value_counts()

Business Systems Development Analyst    45
Tax Accountant                          44
Social Worker                           44
Internal Auditor                        42
Legal Assistant                         41
                                        ..
Geologist II                             4
Research Assistant III                   3
Health Coach I                           3
Health Coach III                         3
Developer I                              1
Name: job_title, Length: 195, dtype: int64

In [17]:
# Replace all NaN elements with the first observed non-null value backward until another non-null value is met
df['job_title']=df['job_title'].fillna(method='bfill')

In [18]:
# checking if all of the NaN elements is being replaced
df['job_title'].isnull().sum()

0

In [19]:
# Counts the unique values for column 'job_industry_category'
df['job_industry_category'].value_counts()

Manufacturing         799
Financial Services    774
Health                602
Retail                358
Property              267
IT                    223
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

In [20]:
# Replace all NaN elements with the first observed non-null value backward until another non-null value is met
df['job_industry_category']=df['job_industry_category'].fillna(method='bfill')

In [21]:
# checking if all of the NaN elements is being replaced
df['job_industry_category'].isnull().sum()

1

In [22]:
# Counts the unique values for column 'tenure'
df['tenure'].value_counts()

7.0     235
5.0     228
11.0    221
10.0    218
16.0    215
8.0     211
18.0    208
12.0    202
9.0     200
14.0    200
6.0     192
13.0    191
4.0     191
17.0    182
15.0    179
1.0     166
3.0     160
19.0    159
2.0     150
20.0     96
22.0     55
21.0     54
Name: tenure, dtype: int64

In [23]:
# Replace all NaN elements with mean of the column
mean = df['tenure'].mean()
df['tenure']=df['tenure'].fillna(mean)

In [24]:
# checking if all of the NaN elements is being replaced
df['tenure'].isnull().sum()

0

In [25]:
# setting the index to the column 'customer_id'
df = df.set_index('customer_id')

In [26]:
# displaying the first 5 rows of the dataset
df.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
customer_id,,,,,,,,,,,
1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0
2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0
3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0
4,Talbot,Dearle,Male,33,1961-10-03,Senior Editor,IT,Mass Customer,N,No,7.0
5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,Retail,Affluent Customer,N,Yes,8.0

In [27]:
# double checking to make sure there is no NA values in each of the columns after data cleaning
df.isnull().sum()

first_name                             0
last_name                              0
gender                                 0
past_3_years_bike_related_purchases    0
DOB                                    0
job_title                              0
job_industry_category                  1
wealth_segment                         0
deceased_indicator                     0
owns_car                               0
tenure                                 0
dtype: int64

In [28]:
df.to_excel("output.xlsx")